Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: Then, I ran `git diff` to see what changed:
es: Tras lo cual he lanzando el comando 'git diff' para ver lo que ha cambiado:

source: You can pretty easily see what files have been modified in a single commit with the `--name-only` option to the `git log` command (mentioned briefly in Chapter 2):
es: Puedes comprobar facilmente qué archivos han sido modificados en cada confirmación de cambios, utilizando la opción '--name-only' del comando 'git log' (citado brevemente en el capítulo 2):

source: Someone pushes rebased commits, abandoning commits you’ve based your work on.
es: Alguien envia (push) confirmaciones (commits) reorganizadas, abandonando las confirmaciones en las que tu habias basado tu trabajo.

source: Here is an example pre-rebase script that checks for that.
es: Este es un ejemplo de script previo a reorganización que lo puede comprobar.

source: Perhaps instead of hosting an internal private project, you want to host an open source project.
es: Por ejemplo, si en lugar de albergar un proyecto privado interno, quieres albergar un proyecto de código abierto.

source: These scripts run before and after pushes to the server.
es: Estos scripts se lanzan antes y después de cada envio (push) al servidor.

source: Also, if you include instructions in the tag message, running `git show <tag>` will let you give the end user more specific instructions about tag verification.
es: Además, si incluyes instrucciones en el mensaje de etiquetado, con el comando 'git show <tag>', los usuarios podrán tener directrices específicas acerca de la verificación de etiquetas.

source: Now you can look at your new commit object with `cat-file`:
es: Con el comando `cat-file` puedes revisar el nuevo objeto de confirmación de cambios recién creado:

source: It performs a three-way merge between the two latest branch snapshots (C3 and C4) and the most recent common ancestor of the two (C2), creating a new snapshot (and commit), as shown in Figure 3-28.
es: Realiza una fusión a tres bandas entre las dos últimas instantáneas de cada rama (C3 y C4) y el ancestro común a ambas (C2); creando una nueva instantánea (snapshot) y la correspondiente confirmación (commit), según se muestra en la Figura 3-28.

source: ### Commit Objects ###
es: ### Objetos de confirmación de cambios ###

source: Now, if you commit and push the project, GitWeb will automatically start showing your iphone project.
es: A partir de ese momento, cuando confirmes cambios (commit) y envies (push) el proyecto, GitWeb comenzará a mostrar tu proyecto iphone.

source: Now, Jessica can merge her topic work into her master branch, merge John’s work (`origin/master`) into her `master` branch, and then push back to the server again.
es: Ahora, jessica puede fusionar (merge) su trabajo de la rama puntual 'issue54' en su rama 'master'l, fusionar (merge) el trabajo de John ('origin/master') en su rama 'master', y enviarla de vuelta al servidor.

source: You’ll do the following:
es: Y sigues los siguientes pasos:

source: Insert 18333fig0403.png Figure 4-3.
es: Insert 18333fig0403.png Figura 4-3.

source: Perhaps it’s a library that a third party developed or that you’re developing separately and using in multiple parent projects.
es: En ocasiones como, por ejemplo, cuando se utiliza una biblioteca de terceros, o cuando se está desarrollando una biblioteca independiente para ser utilizada en múltiples proyectos.

source: You have to figure out how to get the commit message from each of these commits to test.
es: Tienes que imaginarte cómo puedes obtener el mensaj ede cada una de esas confirmaciones de cambios a comprobar.

source: It’s important to note that this file is version-controlled with your other files, like your `.gitignore` file.
es: Merece destacar que este archivo está también bajo el control de versiones, como lo están otros archivos tal como `.gitignore`, por ejemplo.

source: This makes merging a heck of a lot easier in Git than in these other systems.
es: Esto hace que en Git sea mucho más facil el realizar fusiones.

source: You can also use Git attributes to tell Git to use different merge strategies for specific files in your project.
es: También puedes utilizar los atributos Git para indicar distintas estrategias de fusión para archivos específicos de tu proyecto.

source: For instance, if you want to show the last commit object on a branch, the following commands are equivalent, assuming that the `topic1` branch points to `ca82a6d`:
es: Por ejemplo, si se desea mostrar la última confirmación de cambios en una rama, y suponiendo que la rama 'topic1' apunta a 'ca82a6d', los tres comandos siguientes son equivalentes:

source: Jessica wants to sync up with John, so she fetches:
es: Jessica desea sincronizarse con John, para lo cual:

source: We’ll use the normal path here because doing so is almost always faster.
es: Habitualmente, usaremos el camino (path) normal por ser casi siempre más rápido.

source: Next, you have to manually set the execute bit on the `post-update` script for your new control repository.
es: A continuanción, has de ajustar manualmente el bit de ejecución en el script 'post-update' de tu nuevo repositorio de contrrol:

source: Insert 18333fig0330.png Figure 3-30.
es: Insert 18333fig0330.png Figura 3-30.

source: This way, it’s easy to tweak a patch individually and leave it if it’s not working until you have time to come back to it.
es: De esta forma, es sencillo tratar cada parche de forma individualizada y poder "aparcar" uno concreto cuando no trabajamos en él, hasta cuando volvamos a tener tiempo para retomarlo.

source: The other way you can do this is via server-side receive hooks, which I’ll cover in a bit.
es: Otra manera de obtener el mismo resultado, es a través de los enganches (hooks) en el lado servidor. Enganches de los que hablaremos en breve.

source: These days, you have a huge number of hosting options to choose from, each with different advantages and disadvantages.
es: Actualmente tienes un gran número de opciones del alojamiento, cada una con sus ventajas y desventajas.

source: If `master` is a direct ancestor of your topic branch, this isn’t a problem; but if the two histories have diverged, the diff will look like you’re adding all the new stuff in your topic branch and removing everything unique to the `master` branch.
es: Si 'master' es un ancestro directo de tu rama puntual, no tendrás problemas. Pero si los historiales de las dos ramas son divergentes, la comparación directa de diferencias dará la apariencia de estar añadiendo todo el material nuevo en la rama puntual y de estar borrando todo el material nuevo en la rama 'master'.

source: You’ll learn how to be a benevolent dictator or integration manager.
es: Vas a aprender cómo ser un dictador benevolente o un gestor de integración.

source: This means you can have several branches that are always open and that you use for different stages of your development cycle; you can merge regularly from some of them into others.
es: Esto te posibilita tener varias ramas siempre abiertas, e irlas usando en diferentes etapas del ciclo de desarrollo; realizando frecuentes fusiones entre ellas.

source: And you can specify older commits with this data, as well.
es: Y esta información se puede utilizar para referirse a confirmaciones de cambio pasadas.

source: In reality, we’re talking about pointers moving up the line of commits you’re making.
es: En realidad, en todo momento estamos hablando simplemente de apuntadores moviendose por la línea temporal de confirmaciones de cambio (commit history).

source: We’ve covered basic branching and merging in Git.
es: Hemos visto los procedimientos básicos de ramificación (branching) y fusión (merging) en Git.

source: You’ll see a remote rejected message for each reference that your hook declined, and it tells you that it was declined specifically because of a hook failure.
es: Un mensaje por cada referencia rechazada por el enganche (hook) de actualización, especificando que ha sido rechazada precisamente por un fallo en el enganche.

source: More stable branches are generally farther down the commit history.
es: Las ramas más estables apuntan hacia posiciones más antiguas en el registro de cambios.

source: That approach lets you do more complex things like deny non-fast-forwards to a certain subset of users.
es: Esta otra vía te permite realizar ajustes más finos, tales como denegar refencias de avance no directo, (non-fast-forwards), unicamente a un grupo de usuarios.

source: Notice that you don’t need to specify the path (in fact, doing so won’t work), just a colon and then the name of the project — Gitosis finds it for you.
es: Ten en cuenta que no es necesario indicar expresamente un camino (path), --de hecho, si lo haces, no funcionará--. Simplemente, has de poner un punto y el nombre del proyecto, --Gitosis se encargará de encontrarlo--.

source: The `.pub` file is your public key, and the other file is your private key.
es: El archivo terminado en '.pub' es tu clave pública, y el otro archivo es tu clave privada.

source: For more information about the differences in efficiency between the HTTP protocol and the other protocols, see Chapter 9.
es: Para más información sobre diferencias de eficiencia entre el protocolo HTTP y los otros protocolos, ver el Capítulo 9.

source: In this case, the company is using a type of integration-manager workflow where the work of the individual groups is integrated only by certain engineers, and the `master` branch of the main repo can be updated only by those engineers.
es: En este caso, la compañia está utilizando un flujo de trabajo del tipo gestor-de-integración, donde el trabajo de algunos grupos individuales es integrado por unos ingenieros concretos; siendo solamente estos últimos quienes pueden actualizar la rama 'master' del repositorio principal.

source: #### SSH Access ####
es: #### Acceso SSH ####

source: The first thing you’ll do is write your ACL.
es: Como hemos dicho, el primer paso es escribir tu lista de control de accesos (ACL).

source: Then, you can use a branch name in any Git command that expects a commit object or SHA-1 value.
es: De esta forma, se puede emplear el nombre de la rama en cualquier comando Git que espere un objeto de confirmación de cambios o un código SHA-1.

source: Now, John can test his code to make sure it still works properly, and then he can push his new merged work up to the server:
es: En este momento, John puede comprobar su código para verificar que sigue funcionando correctamente, y luego puede enviar su trabajo al servidor:

source: This also means the changes you make from this point forward will diverge from an older version of the project.
es: Esto supone que los cambios que hagas desde este momento en adelante divergerán de la antigua versión del proyecto.

source: You can set up an attribute like this:
es: Puedes ajustar un atributo tal como:

source: There are two ways to apply an e-mailed patch: with `git apply` or with `git am`.
es: Tienes dos caminos para incorporar un parche recibido por correo-e: usando el comando 'git apply' o usando el comando 'git am'.

source: Now, you can set up an empty repository for them by running `git init` with the `--bare` option, which initializes the repository without a working directory:
es: Tras esto, puedes preparar un repositorio básico vacio para ellos, usando el comando 'git init' con la opción '--bare' para inicializar el repositorio sin carpeta de trabajo:

source: Suffice it to say that this is rare.
es: Ni que decir tiene que esto solo lo necesitarás en contadas ocasiones.

source: But those are the only two differences — otherwise, the script works the same way.
es: Estas dos son las únicas diferencias; en todo lo demás, el script funciona de la misma manera.

source: This makes for a very powerful revision query system that should help you figure out what is in your branches.
es: Esto da una enorme versatilidad al sistema de consultas y permite revisar el contenido de todas las ramas en el repositorio.

source: That shows you where the branch tip was yesterday.
es: Este comando mostrará a dónde apuntaba ayer la rama.

source: Great.
es: Estupendo.

source: At this point, you should be able to go to your Drafts folder, change the To field to the mailing list you’re sending the patch to, possibly CC the maintainer or person responsible for that section, and send it off.
es: En estos momentos, deberías poder ir a tu carpeta de borradores (Drafts), cambiar el destinatario (To) para apuntar a la lista de correo donde estés enviando el parche, puede que poner en copia (CC) al gestor o persona responsable, y enviar el mensaje.

source: Insert 18333fig0701.png Figure 7-1.
es: Insert 18333fig0701.png Figura 7-1.

source: The latter wouldn’t be ideal, because all your code repository instances would reside on the same computer, making a catastrophic loss much more likely.
es: Aunque este último caso no es precisamente el ideal, ya que todas las instancias del repositorio estarían en la misma máquina; aumentando las posibilidades de una pérdida catastrófica.

source: The content-addressable filesystem layer is amazingly cool, so I’ll cover that first in this chapter; then, you’ll learn about the transport mechanisms and the repository maintenance tasks that you may eventually have to deal with.
es: La capa del sistema de archivos que almacena el contenido es increiblemente interesante; por ello, es lo primero que voy a desarrollar en este capítulo. A continuación mostraré los mecanismos de transporte y las tareas de mantenimiento del repositorio que posiblemente necesites usar alguna vez.

source: #### Diffing Binary Files ####
es: #### Comparando archivos binarios ####

source: In Chapter 7, you’ll learn how to do more complicated manual project imports.
es: En el capítulo 7, aprenderás cómo realizar importaciones manuales de proyectos complejos.

source: Gitosis requires some Python tools, so first you have to install the Python setuptools package, which Ubuntu provides as python-setuptools:
es: Gitosis necesita de ciertas herramientas Python, por lo que la primera tarea será instalar el paquete de herramientas Pyton. En Ubuntu viene como el paquete python-stuptools:

source: # on your local computer $ git clone git@gitserver:gitosis-admin.git
es: a tu ordenador personal-- $ git clone git@gitserver:gitosis-admin.git

source: You can’t stop the patching process with this script.
es: No puedes detener el proceso de parcheo con este script.

source: You can keep doing this for several levels of stability.
es: Este sistema de trabajo se puede ampliar para diversos grados de estabilidad.

source: In this section, you’ll use what you’ve learned to establish a Git workflow that checks for a custom commit message format, enforces fast-forward-only pushes, and allows only certain users to modify certain subdirectories in a project.
es: En esta sección, utilizarás lo aprendido para establecer un flujo de trabajo en Git que: compruebe si los mensajes de confirmación de cambios encajan en un determinado formato, obligue a realizar solo envios de avance directo, y permita solo a ciertos usuarios modificar ciertas carpetas del proyecto.

source: You want to see what is in your experiment branch that hasn’t yet been merged into your master branch.
es: Si se desea ver qué partes de la rama experiment están sin fusionar aún con la rama master.

source: Another useful option to figure out what state your branches are in is to filter this list to branches that you have or have not yet merged into the branch you’re currently on.
es: Otra opción útil para averiguar el estado de las ramas, es filtrarlas y mostrar solo aquellas que han sido fusionadas (o que no lo han sido) con la rama actualmente activa.

source: Here you must choose a username that isn’t yet taken in the system and enter an e-mail address that will be associated with the account and a password (see Figure 4-3).
es: En ella, has de elegir un nombre de usuario que esté libre, indicar una cuenta de correo electrónico y poner una contraseña.

source: In the Git source code, for example, the maintainer has added their GPG public key as a blob object and then tagged it.
es: Por ejemplo, en el código fuente de Git los gestores han añadido su clave GPG pública como un objeto binario (blob) y lo han etiquetado.

source: Wouldn’t it be nice if Git could store one of them in full but then the second object only as the delta between it and the first?
es: ¿No seria práctico si Git pudiera almacenar uno de ellos completo y luego solo las diferencias del segundo con respecto al primero?

source: Figure 3-29 illustrates this process.
es: El proceso se muestra en la Figura 3-29.

source: Now you have the root of the Rack project in your `rack_branch` branch and your own project in the `master` branch.
es: En este punto, se tiene la raiz del proyecto Rack en la rama `rack_branch` y la del propio proyecto padre en la rama `master`.

source: That installs a couple of executables that Gitosis will use.
es: Esto instala un par de ejecutables, que serán los que Gitosis utilice.

source: The issue is that you generally don’t want to work in a detached head environment, because it’s easy to lose changes.
es: Este método de trabajo suele tenderse a evitar, ya que trabajando en un entorno de cabecera desconectada es bastante facil despistarse y perder cambios ya realizados.

source: If you push commits somewhere and others pull them down and base work on them, and then you rewrite those commits with `git rebase` and push them up again, your collaborators will have to re-merge their work and things will get messy when you try to pull their work back into yours.
es: Si envias (push) confirmaciones (commits) a alguna parte, y otros las recogen (pull) de allí. Y después vas tu y las reescribes con 'git rebase' y las vuelves a enviar (push) de nuevo. Tus colaboradores tendrán que refusionar (re-merge) su trabajo y todo se volverá tremendamente complicado cuando intentes recoger (pull) su trabajo de vuelta sobre el tuyo.

source: All the changes from your Rack project are merged in and ready to be committed locally.
es: Con esto, todos los cambios en el proyecto Rack se encontrarán fusionados y listos para ser confirmados localmente.

source: This is nice if you have a number of patches saved, because you can view the patch first if you don’t remember what it is, or not apply the patch if you’ve already done so.
es: Es una utilidad interesante si tienes tienes almacenados unos cuantos parches, porque puedes ir revisando previamente cada parche y aplicarlos selectivamente.

source: As you’ll remember, you can create the branch based off your master branch like this:
es: Como recordarás, la forma de crear una rama basandola en tu rama master es:

source: Next, you need to add some developer SSH public keys to the `authorized_keys` file for that user.
es: Y a continuación añades las claves públicas de los desarrolladores al archivo 'autorized_keys' del usuario 'git' que has creado.

source: But in Git it’s common to create, work on, merge, and delete branches several times a day.
es: Pero en Git, por el contrario, es muy habitual el crear, trabajar con, fusionar y borrar ramas varias veces al día.

source: You’ll also take this opportunity to move the work to be based off the project’s current `master` branch.
es: Puedes aprovechar también esta oportunidad para mover el trabajo y actualizarlo sobre la actual rama 'master' del proyecto.

source: The cons of this method are that shared access is generally more difficult to set up and reach from multiple locations than basic network access.
es: La principal desventaja de los repositorios basados en carpetas y archivos es su dificultad de acceso desde distintas ubicaciones.

source: There is a bit of a problem — she needs to push the merged work in her `featureB` branch to the `featureBee` branch on the server.
es: Pero hay un pequeño problema, necesita enviar el trabajo fusionado en su rama 'featureB' a la rama 'featureBee' del servidor.

source: Because this is a pretty cool and not widely known feature, I’ll go over a few examples.
es: Esta es una funcionalidad muy util, pero bastante desconocida. Por lo que la ilustraré con unos ejemplos.

source: ## Branching Workflows ##
es: ## Flujos de trabajo ramificados ##

source: From that point forward, it should be called.
es: A partir de ese momento, será automáticamente lanzado cuando se dé la acción correspondiente.

source: Insert 18333fig0302.png Figure 3-2.
es: Insert 18333fig0302.png Figura 3-2.

source: This is roughly equivalent to something like
es: Siendo el proceso mas o menos equivalente a haber realizado:

source: You’ll rarely want `color.ui = always`.
es: Será muy raro ajustar 'color.ui = always'.

source: You can see that this command shows you a much different view of your staging area — basically the same information you get with `git status` but a bit more succinct and informative.
es: Según se ve, este comando muestra una vista bastante diferente del área de preparación (staging area). Básicamente se trata de la misma información dada por el comando 'git status', pero mas sucinta e informativa.

source: The GitWeb web-based user interface.
es: El interface web GitWeb.

source: At that point, everyone will be able to access that machine via the 'git' user.
es: De esta forma, todos pueden acceder a la máquina a través del usuario 'git'.

source: If you pass `--objects` to `rev-list`, it lists all the commit SHAs and also the blob SHAs with the file paths associated with them.
es: Con la opción `--objects`, obtendrás la lista de todas las SHA de todas las confirmaciones de cambio, junto a las SHA de los objetos binarios y las ubicaciones (paths) de cada uno de ellos.

source: It also requires firewall access to port 9418, which isn’t a standard port that corporate firewalls always allow.
es: Requiere además abrir expresamente acceso al puerto 9418 en el cortafuegos, ya que este no es uno de los puertos estandares que suelen estar habitualmente permitidos en los cortafuegos corporativos.

source: One way to do this is to run JPEG files through a filter that extracts their EXIF information — metadata that is recorded with most image formats.
es: Un camino puede ser pasar los archivos JPEG a través de un filtro para extraer su información EXIF --los metadatos que se graban dentro de la mayoria de formatos gráficos--.

source: Insert 18333fig0904.png Figure 9-4.
es: Insert 18333fig0904.png Figura 9-4.

source: Suppose you’re developing a web site and creating Atom feeds.
es: Supongamos que se está desarrollando un site web y creando feeds Atom.

source: When you run `git commit`, it creates the commit object, specifying the parent of that commit object to be whatever SHA-1 value the reference in HEAD points to.
es: Cuando lanzas una orden `git commit`, se crea un nuevo objeto de confirmación de cambios teniendo como padre la confirmación con valor SHA-1 a la que en ese momento esté apuntando la referencia en HEAD.

source: At this point, you can easily switch branches and do work elsewhere; your changes are stored on your stack.
es: Y se permite cambiar de rama para ponerse a trabajar en cualquier otra parte. Con la tranquilidad de que los cambios a medio completar están guardados a buen recaudo en la pila de guardado rápido.

source: That is a very useful syntax to remember.
es: Es una sintaxis muy util, que merece recordar.

source: You should feel fairly comfortable contributing to a project in Git as well as maintaining your own project or integrating other users’ contributions.
es: A estas alturas, deberías sentirte confortable tanto contribuyendo a un proyecto, como manteniendo tu propio proyecto o integrando contribuciones de otras personas.
